{
  "header": {
    "headline": "Terms of Service",
    "lastUpdated": {
      "text": "Last updated: ",
      "date": "January 18, 2026"
    },
    "description": "These Terms and Conditions govern your use of Clipposaurus, a web-based content sharing service. By accessing or using Clipposaurus, you agree to comply with these terms."
  },
  "sections": [
    {
      "id": "1",
      "title": "Service Description",
      "description": "Clipposaurus allows users to temporarily share text and code snippets between devices without requiring registration. Key features include end-to-end encryption, automatic content expiration, and cross-device accessibility via unique share codes."
    },
    {
      "id": "2",
      "title": "User Eligibility",
      "description": "You must be at least 13 years old to use Clipposaurus. By using the service, you represent that you meet this age requirement and have the legal capacity to enter into these terms."
    },
    {
      "id": "3",
      "title": "Acceptable Use",
      "description": "You agree to use Clipposaurus only for lawful purposes. Prohibited activities include sharing illegal content, malware, infringing material, or engaging in any activity that violates these terms or applicable laws."
    },
    {
      "id": "4",
      "title": "Content Ownership and Responsibility",
      "description": "You retain ownership of the content you share. However, you are solely responsible for ensuring you have the right to share it. Clipposaurus does not claim ownership of your content and is not liable for any misuse."
    },
    {
      "id": "5",
      "title": "Privacy and Security",
      "description": "We prioritize your privacy. Shared content is encrypted, and we do not store personal information unless necessary for service operation. We use Vercel Analytics to track visitors and page views for improving our service."
    },
    {
      "id": "6",
      "title": "Service Limitations",
      "description": "Clipposaurus provides temporary sharing with automatic expiration. We do not guarantee permanent storage or availability beyond the set expiration time. The service may be unavailable due to maintenance or technical issues."
    },
    {
      "id": "7",
      "title": "Service Limitations",
      "description": "Clipposaurus provides temporary sharing with automatic expiration. We do not guarantee permanent storage or availability beyond the set expiration time. The service may be unavailable due to maintenance or technical issues."
    },
    {
      "id": "8",
      "title": "Termination",
      "description": "We reserve the right to terminate or suspend access to Clipposaurus at our discretion, without notice, for violations of these terms or for any other reason."
    },
    {
      "id": "9",
      "title": "Disclaimers and Limitation of Liability",
      "description": "Clipposaurus is provided 'as is' without warranties. We are not liable for any damages arising from your use of the service, including data loss or security breaches, to the extent permitted by law."
    },
    {
      "id": "10",
      "title": "Changes to Terms",
      "description": "We may update these Terms and Conditions at any time. Continued use of the service after changes constitutes acceptance of the new terms."
    },
    {
      "id": "11",
      "title": "Governing Law",
      "description": "These terms are governed by the laws of [Your Jurisdiction]. Any disputes will be resolved in the courts of [Your Jurisdiction]."
    },
    {
      "id": "12",
      "title": "Contact Us",
      "description": "If you have questions about these Terms and Conditions, please contact us at [contact information]."
    }
  ],
  "footer": {
    "text": "Need any help?",
    "buttonText": "Contact Us"
  }
}
